In [1]:
import pandas as pd

In [2]:
 df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[8,9,10,11],[23,45,67,89]],columns=['A','B','C','D'])

In [3]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   8   9  10  11
3  23  45  67  89

In [28]:
 df2=pd.DataFrame([[11,12,2,14],[25,26,6,28],[38,9,9,311],[423,445,45,489]],columns=['V','X','Y','Z'])

In [29]:
df2

     V    X   Y    Z
0   11   12   2   14
1   25   26   6   28
2   38    9   9  311
3  423  445  45  489

In [30]:
df3=pd.merge(df1,df2,right_on='Y',left_on='B')

In [31]:
df3

    A   B   C   D    V    X   Y    Z
0   1   2   3   4   11   12   2   14
1   5   6   7   8   25   26   6   28
2   8   9  10  11   38    9   9  311
3  23  45  67  89  423  445  45  489

# row and col index swap accordingly

In [35]:
df4=pd.DataFrame([[11,12,6,14],[25,26,2,28],[38,9,45,311],[423,445,9,489]],columns=['V','X','Y','Z'])

In [36]:
df3=pd.merge(df1,df4,right_on='Y',left_on='B')

In [37]:
df3

    A   B   C   D    V    X   Y    Z
0   1   2   3   4   25   26   2   28
1   5   6   7   8   11   12   6   14
2   8   9  10  11  423  445   9  489
3  23  45  67  89   38    9  45  311

# 0 and 1 inex of df4 become swapped according to the 2---2, 6---6, 9---9,45--45